[
    {
        "made-by": "Dwabzy",
        "date": "",
        "changes": [
            "Removed the Two Values - cardColor and textColor that were sent to backend during creation of card, cuz settings for card can be done in settings page",
            "Removed all the await statements in chip/ card update and delete that werent necessary",
            "Blocked card creation if a chip Exist and vice versa",
            "Added comments in NLP.js file with clear explanaitions.",
            "Removed getCardTheme and updateCardTheme functions in SQL-settings.js as they aren't used",
            "Settings Changes wasnt working so removed the if(_isMounted) in response of getSettings and removed the componentDidUnmount()",
            "Card creation fixed and the card color and text color option removed from creation modal.",
            "Card display works while chatting now."
        ],
        "to-do": [
            "chat-body.png in settings page doesn't work. Says Error 404 not found",
            "Add ability to have multiple databases connected, or atleast the ability to switch between them",
            "Adding complex queries like JOIN. For now, we can only have queries made from a single table in each intent",
            "Follow up shouldnt work if you say the same sentence again, Ask Dwabzy for more explanation if you don't understand what I am trying to say",
            "Server crashes when you try to run a query without adding Database name",
            "Need to be able to edit or delete database connection",
            "Allow entity value to be able to given as an input in run queries",
            "setting card crash",

            "Logout button doesnt work in any page( it doesnt redirect but clears the session storage)",
            "Modal for create chip is annoying, replace it with what we have for messages",
            "Fix Time in the asssitant Display",
            "Add Edit Modal Box for Card",
            "Display Follow Up intents in an hierarchical form"
        ]
    },
    {
        "made-by": "Prajeshwar",
        "changes": [
            "drag and drop in chips",
            "No bot display image",
            "Assistant delete confirmation",
            "create chip fixed",
            "Time in assistant display",
            "edit card modal"
        ],
        "to-do": [
            "chat-body.png in settings page doesn't work. Says Error 404 not found",
            "Display Follow Up intents in an hierarchical form",
            "STATS"
        ]
    }
]